
/**
 * Created by kankan on 2019-09-29.
 * E-mail: lidainzhong@gl-data.com
 * To: More pain, more gain.
 */

const fs = require('fs');

// map
fs.readFile('./test/map.json',function(err,data){
  // eslint-disable-next-line no-console
  err && console.log(err);
  let allData = data.toString();
  allData = JSON.parse(allData);
  allData = {};
  allData.data = [];
  let addr = {
    "钓鱼岛":[123.52912600000002,25.77291945505976],
    "台北市": [121.5200759999999,25.031773884554273],
    "香港": [114.16546000000001,22.277206484384898],
    "澳门": [113.54913,22.20061750478515],
    "北京市": [116.46, 39.92],
    "天津市": [117.2, 39.13],
    "河北省": [114.48, 38.03],
    "山西省": [112.53, 37.87],
    "内蒙古自治区": [111.65, 40.82],
    "辽宁省": [123.38, 41.8],
    "吉林省": [125.35, 43.88],
    "黑龙江省": [126.63, 45.75],
    "上海市": [121.48, 31.22],
    "江苏省": [118.78, 32.04],
    "浙江省": [120.19, 30.26],
    "安徽省": [117.27, 31.86],
    "福建省": [119.3, 26.08],
    "江西省": [115.89, 28.68],
    "山东省": [116.75199, 36.65],
    "河南省": [113.65, 34.76],
    "湖北省": [114.31, 30.52],
    "湖南省": [113, 28.21],
    "广东省": [113.23, 23.16],
    "广西壮族自治区": [110.28, 25.29],
    "海南省": [110.35, 20.02],
    "重庆市": [106.54, 29.59],
    "四川省": [104.06, 30.67],
    "贵州省": [106.71, 26.57],
    "云南省": [102.73, 25.04],
    "西藏自治区": [91.11, 29.97],
    "陕西省": [108.95, 34.27],
    "甘肃省": [103.73, 36.03],
    "青海省": [101.74, 36.56],
    "宁夏回族自治区": [106.27, 38.47],
    "新疆维吾尔自治区": [87.68, 43.77],
  };
  let city = {
    110001:"台北市",
    110002:"香港",
    110003:"澳门",
    110004:"钓鱼岛",
    110000: "北京市",
    120000: "天津市",
    130000: "河北省",
    140000: "山西省",
    150000: "内蒙古自治区",
    210000: "辽宁省",
    220000: "吉林省",
    230000: "黑龙江省",
    310000: "上海市",
    320000: "江苏省",
    330000: "浙江省",
    340000: "安徽省",
    350000: "福建省",
    360000: "江西省",
    370000: "山东省",
    410000: "河南省",
    420000: "湖北省",
    430000: "湖南省",
    440000: "广东省",
    450000: "广西壮族自治区",
    460000: "海南省",
    500000: "重庆市",
    510000: "四川省",
    520000: "贵州省",
    530000: "云南省",
    540000: "西藏自治区",
    610000: "陕西省",
    620000: "甘肃省",
    630000: "青海省",
    640000: "宁夏回族自治区",
    650000: "新疆维吾尔自治区"
  };
  let keys = Object.keys(city);
  for(let i=0;i<keys.length;i++) {
    allData.data.push({
      code: keys[i],
      count: Math.round(Math.random() * 100),
      percent: Math.random().toFixed(4),
      // percent: Math.random().toFixed(4) * 100,
    });
  }

    allData.total = allData.data.length;
    let s = JSON.stringify(allData);
  // eslint-disable-next-line no-console
    fs.writeFile('./test/map.json', s,err=> console.log(err ? 'err':'success'))

});
